tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'thoughtbot/formulae'
tap 'fisherman/tap'

#  Utils
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'
brew 'ag'
brew 'tree'
brew 'rename'
brew 'ctags'

# Basic
brew 'fish'
brew 'fisherman'
brew 'macvim', args: ['override-system-vim']
brew 'git'
brew 'node'
brew 'rcm'

# Other
brew 'rbenv'
brew 'ruby-build'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'

# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'webpquicklook'

# Programs
cask 'alfred'
cask 'divvy'
cask 'dropbox'
cask 'iterm2'
cask 'sublime-text'
cask 'google-chrome'
cask 'vlc'
