tap 'caskroom/cask'
tap 'caskroom/versions'

#  Utils
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']
brew 'grc' # generic colouriser  http://kassiopeia.juls.savba.sk/~garabik/software/grc/
brew 'bash'
brew 'bash-completion'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'
brew 'wget', args: ['enable-iri']
brew 'ack'
brew 'ag'
brew 'tree'
brew 'rename'
brew 'imagemagick', args: ['with-webp']

# Basic
# brew  'vim', args: ['override-system-vi']
brew 'macvim', args: ['override-system-vim']
brew  'git'
brew  'node'

brew 'autojump'
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tmux'

tap 'thoughtbot/formulae'
brew 'gitsh'
brew 'rcm'

# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'webpquicklook'

# Programs
cask 'alfred'
cask 'divvy'
cask 'dropbox'
cask 'iterm2'
cask 'sublime-text3'
cask 'google-chrome'
cask 'vlc'
